In [1]:
import pandas as pd 
import numpy as np

In [2]:
remote_url = "https://raw.githubusercontent.com/prodramp/publiccode/master/datasets/titanic.csv"

In [3]:
df = pd.read_csv(remote_url)

In [4]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [5]:
# Only added to display images for explaining the concept
from IPython.display import Image, display

# Shifting (Moving Rows) Vertically (To to Bottom and vice verse)

In [6]:
display(Image(url='https://miro.medium.com/max/1400/1*lGPAbHRtK1TArAzB_6hzVQ.png', width=800, unconfined=True))
print("Image source: https://towardsdatascience.com/all-the-pandas-shift-you-should-know-for-data-analysis-791c1692b5e")

Image source: https://towardsdatascience.com/all-the-pandas-shift-you-should-know-for-data-analysis-791c1692b5e

In [8]:
#df.shift(1) | default is axis = 0
df.shift(periods=1, )

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1.0,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
2,2.0,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
3,3.0,1.0,3.0,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,NaN,S
4,4.0,1.0,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,886.0,0.0,3.0,"Rice, Mrs. William (Margaret Norton)",female,39.0,0.0,5.0,382652,29.1250,NaN,Q
887,887.0,0.0,2.0,"Montvila, Rev. Juozas",male,27.0,0.0,0.0,211536,13.0000,NaN,S
888,888.0,1.0,1.0,"Graham, Miss. Margaret Edith",female,19.0,0.0,0.0,112053,30.0000,B42,S
889,889.0,0.0,3.0,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.0,2.0,W./C. 6607,23.4500,NaN,S
890,890.0,1.0,1.0,"Behr, Mr. Karl Howell",male,26.0,0.0,0.0,111369,30.0000,C148,C

In [9]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [12]:
# Try any positive number
df.shift(periods=1000)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
886,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
887,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
888,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
889,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
890,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [17]:
df.shift(-890)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,891.0,0.0,3.0,"Dooley, Mr. Patrick",male,32.0,0.0,0.0,370376,7.75,NaN,Q
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
886,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
887,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
888,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
889,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
890,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [25]:
df.shift(-100, fill_value=0)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,101,0,3,"Petranec, Miss. Matilda",female,28.0,0,0,349245,7.8958,NaN,S
1,102,0,3,"Petroff, Mr. Pastcho (""Pentcho"")",male,NaN,0,0,349215,7.8958,NaN,S
2,103,0,1,"White, Mr. Richard Frasar",male,21.0,0,1,35281,77.2875,D26,S
3,104,0,3,"Johansson, Mr. Gustaf Joel",male,33.0,0,0,7540,8.6542,NaN,S
4,105,0,3,"Gustafsson, Mr. Anders Vilhelm",male,37.0,2,0,3101276,7.9250,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,0,0,0,0,0.0,0,0,0,0.0000,0,0
887,0,0,0,0,0,0.0,0,0,0,0.0000,0,0
888,0,0,0,0,0,0.0,0,0,0,0.0000,0,0
889,0,0,0,0,0,0.0,0,0,0,0.0000,0,0
890,0,0,0,0,0,0.0,0,0,0,0.0000,0,0

In [26]:
# .describe() / fill with "100" and 100 too
df.shift(periods=1000, fill_value=0)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,0,0,0,0,0.0,0,0,0,0.0,0,0
1,0,0,0,0,0,0.0,0,0,0,0.0,0,0
2,0,0,0,0,0,0.0,0,0,0,0.0,0,0
3,0,0,0,0,0,0.0,0,0,0,0.0,0,0
4,0,0,0,0,0,0.0,0,0,0,0.0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,0,0,0,0,0.0,0,0,0,0.0,0,0
887,0,0,0,0,0,0.0,0,0,0,0.0,0,0
888,0,0,0,0,0,0.0,0,0,0,0.0,0,0
889,0,0,0,0,0,0.0,0,0,0,0.0,0,0
890,0,0,0,0,0,0.0,0,0,0,0.0,0,0

# Shifting (Moving Rows) Horizontally (Left to Right and vice verse) with axis

In [7]:
display(Image(url='https://miro.medium.com/max/1400/1*no674iU2cbSFOQYfxrP-pA.png', width=800, unconfined=True))
print("Image source: https://towardsdatascience.com/all-the-pandas-shift-you-should-know-for-data-analysis-791c1692b5e")

Image source: https://towardsdatascience.com/all-the-pandas-shift-you-should-know-for-data-analysis-791c1692b5e

In [27]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [31]:
# Shifting horizontally to the right > Moving columns to their next right
df.shift(2, axis=1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,NaN,NaN,1.0,NaN,NaN,NaN,0.0,3.0,"Braund, Mr. Owen Harris",NaN,male,A/5 21171
1,NaN,NaN,2.0,NaN,NaN,NaN,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",NaN,female,PC 17599
2,NaN,NaN,3.0,NaN,NaN,NaN,1.0,3.0,"Heikkinen, Miss. Laina",NaN,female,STON/O2. 3101282
3,NaN,NaN,4.0,NaN,NaN,NaN,1.0,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",NaN,female,113803
4,NaN,NaN,5.0,NaN,NaN,NaN,0.0,3.0,"Allen, Mr. William Henry",NaN,male,373450
...,...,...,...,...,...,...,...,...,...,...,...,...
886,NaN,NaN,887.0,NaN,NaN,NaN,0.0,2.0,"Montvila, Rev. Juozas",NaN,male,211536
887,NaN,NaN,888.0,NaN,NaN,NaN,1.0,1.0,"Graham, Miss. Margaret Edith",NaN,female,112053
888,NaN,NaN,889.0,NaN,NaN,NaN,0.0,3.0,"Johnston, Miss. Catherine Helen ""Carrie""",NaN,female,W./C. 6607
889,NaN,NaN,890.0,NaN,NaN,NaN,1.0,1.0,"Behr, Mr. Karl Howell",NaN,male,111369
890,NaN,NaN,891.0,NaN,NaN,NaN,0.0,3.0,"Dooley, Mr. Patrick",NaN,male,370376

In [32]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [33]:
# Shifting horizontally to the left (nagative number) > Moving columns to their next left
df.shift(-1, axis=1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0.0,3.0,1.0,male,A/5 21171,7.2500,0.0,NaN,NaN,NaN,S,NaN
1,1.0,1.0,1.0,female,PC 17599,71.2833,0.0,NaN,C85,NaN,C,NaN
2,1.0,3.0,0.0,female,STON/O2. 3101282,7.9250,0.0,NaN,NaN,NaN,S,NaN
3,1.0,1.0,1.0,female,113803,53.1000,0.0,NaN,C123,NaN,S,NaN
4,0.0,3.0,0.0,male,373450,8.0500,0.0,NaN,NaN,NaN,S,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
886,0.0,2.0,0.0,male,211536,13.0000,0.0,NaN,NaN,NaN,S,NaN
887,1.0,1.0,0.0,female,112053,30.0000,0.0,NaN,B42,NaN,S,NaN
888,0.0,3.0,1.0,female,W./C. 6607,23.4500,2.0,NaN,NaN,NaN,S,NaN
889,1.0,1.0,0.0,male,111369,30.0000,0.0,NaN,C148,NaN,C,NaN
890,0.0,3.0,0.0,male,370376,7.7500,0.0,NaN,NaN,NaN,Q,NaN

# Shifting Datetime (Index) with freq

In [34]:
covid_cases_url = 'https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_deaths_global.csv'

In [35]:
df_covid = pd.read_csv(covid_cases_url, delimiter=',', header='infer')

In [36]:
df_covid

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,1/19/22,1/20/22,1/21/22,1/22/22,1/23/22,1/24/22,1/25/22,1/26/22,1/27/22,1/28/22
0,NaN,Afghanistan,33.939110,67.709953,0,0,0,0,0,0,...,7386,7386,7390,7390,7393,7393,7397,7401,7403,7403
1,NaN,Albania,41.153300,20.168300,0,0,0,0,0,0,...,3283,3286,3292,3297,3305,3305,3312,3317,3323,3329
2,NaN,Algeria,28.033900,1.659600,0,0,0,0,0,0,...,6443,6453,6468,6481,6495,6508,6516,6526,6539,6545
3,NaN,Andorra,42.506300,1.521800,0,0,0,0,0,0,...,142,144,144,144,144,144,145,145,145,145
4,NaN,Angola,-11.202700,17.873900,0,0,0,0,0,0,...,1877,1881,1884,1886,1888,1888,1891,1892,1893,1893
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
275,NaN,Vietnam,14.058324,108.277199,0,0,0,0,0,0,...,36114,36266,36443,36596,36719,36884,37010,37165,37291,37432
276,NaN,West Bank and Gaza,31.952200,35.233200,0,0,0,0,0,0,...,5031,5036,5042,5042,5042,5056,5061,5072,5074,5076
277,NaN,Yemen,15.552727,48.516388,0,0,0,0,0,0,...,1994,1995,1995,1995,1995,1995,1995,2003,2005,2006
278,NaN,Zambia,-13.133897,27.849332,0,0,0,0,0,0,...,3877,3879,3885,3890,3895,3900,3905,3906,3907,3910
279,NaN,Zimbabwe,-19.015438,29.154857,0,0,0,0,0,0,...,5266,5276,5288,5292,5294,5305,5316,5321,5324,5333

In [37]:
df_selected = df_covid.loc[
    df_covid['Country/Region'].isin(['United Kingdom', 'US', 'Italy', 'Germany']) & df_covid['Province/State'].isna()]

In [38]:
df_selected

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,1/19/22,1/20/22,1/21/22,1/22/22,1/23/22,1/24/22,1/25/22,1/26/22,1/27/22,1/28/22
134,NaN,Germany,51.165691,10.451526,0,0,0,0,0,0,...,116321,116490,116668,116722,116751,116967,117131,117318,117488,117670
153,NaN,Italy,41.871940,12.567380,0,0,0,0,0,0,...,142205,142590,142963,143296,143523,143875,144343,144770,145159,145537
255,NaN,US,40.000000,-100.000000,0,0,0,0,0,0,...,860498,863109,866229,867051,867624,869608,872607,876647,879006,882881
270,NaN,United Kingdom,55.378100,-3.436000,0,0,0,0,0,0,...,152872,153202,153490,153787,153862,153916,154356,154702,155040,155317

In [39]:
df_selected.rename(index=lambda x: df_selected.at[x, 'Country/Region'], inplace=True)
df_filtered = df_selected.transpose()
df_filtered = df_filtered.drop(['Province/State', 'Country/Region', 'Lat', 'Long'])
df_filtered = df_filtered.loc[(df_filtered != 0).any(1)]

/Users/avkash/anaconda3/lib/python3.7/site-packages/pandas/core/frame.py:4133: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [40]:
df_filtered

        Germany   Italy      US United Kingdom
2/21/20       0       1       0              0
2/22/20       0       2       0              0
2/23/20       0       3       0              0
2/24/20       0       7       0              0
2/25/20       0      10       0              0
...         ...     ...     ...            ...
1/24/22  116967  143875  869608         153916
1/25/22  117131  144343  872607         154356
1/26/22  117318  144770  876647         154702
1/27/22  117488  145159  879006         155040
1/28/22  117670  145537  882881         155317

[708 rows x 4 columns]

In [42]:
df_filtered.describe()

        Germany   Italy   US  United Kingdom
count       708     708  708             708
unique      678     708  700             691
top           0  145537    0               0
freq         17       1    8              14

In [43]:
df_filtered.index = pd.to_datetime(df_filtered.index, errors='coerce')

In [44]:
df_filtered

           Germany   Italy      US United Kingdom
2020-02-21       0       1       0              0
2020-02-22       0       2       0              0
2020-02-23       0       3       0              0
2020-02-24       0       7       0              0
2020-02-25       0      10       0              0
...            ...     ...     ...            ...
2022-01-24  116967  143875  869608         153916
2022-01-25  117131  144343  872607         154356
2022-01-26  117318  144770  876647         154702
2022-01-27  117488  145159  879006         155040
2022-01-28  117670  145537  882881         155317

[708 rows x 4 columns]

In [46]:
df_filtered.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 708 entries, 2020-02-21 to 2022-01-28
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Germany         708 non-null    object
 1   Italy           708 non-null    object
 2   US              708 non-null    object
 3   United Kingdom  708 non-null    object
dtypes: object(4)
memory usage: 27.7+ KB

In [47]:
df_filtered

           Germany   Italy      US United Kingdom
2020-02-21       0       1       0              0
2020-02-22       0       2       0              0
2020-02-23       0       3       0              0
2020-02-24       0       7       0              0
2020-02-25       0      10       0              0
...            ...     ...     ...            ...
2022-01-24  116967  143875  869608         153916
2022-01-25  117131  144343  872607         154356
2022-01-26  117318  144770  876647         154702
2022-01-27  117488  145159  879006         155040
2022-01-28  117670  145537  882881         155317

[708 rows x 4 columns]

In [57]:
# Timeseries data update using freq with shift
df_filtered.shift(freq='1D')

           Germany   Italy      US United Kingdom
2020-02-22       0       1       0              0
2020-02-23       0       2       0              0
2020-02-24       0       3       0              0
2020-02-25       0       7       0              0
2020-02-26       0      10       0              0
...            ...     ...     ...            ...
2022-01-25  116967  143875  869608         153916
2022-01-26  117131  144343  872607         154356
2022-01-27  117318  144770  876647         154702
2022-01-28  117488  145159  879006         155040
2022-01-29  117670  145537  882881         155317

[708 rows x 4 columns]

In [69]:
# Timeseries data update using freq with shift
# Try using 1H, 3H, 1M,  (1W, 1Y) 
df_filtered.shift(freq='1D')
#df_filtered

           Germany   Italy      US United Kingdom
2020-02-22       0       1       0              0
2020-02-23       0       2       0              0
2020-02-24       0       3       0              0
2020-02-25       0       7       0              0
2020-02-26       0      10       0              0
...            ...     ...     ...            ...
2022-01-25  116967  143875  869608         153916
2022-01-26  117131  144343  872607         154356
2022-01-27  117318  144770  876647         154702
2022-01-28  117488  145159  879006         155040
2022-01-29  117670  145537  882881         155317

[708 rows x 4 columns]

# Usage

In [70]:
df_filtered['Daily changes in Germany'] = df_filtered['Germany'] - df_filtered.shift(1)['Germany']

In [71]:
df_filtered

           Germany   Italy      US United Kingdom Daily changes in Germany
2020-02-21       0       1       0              0                      NaN
2020-02-22       0       2       0              0                        0
2020-02-23       0       3       0              0                        0
2020-02-24       0       7       0              0                        0
2020-02-25       0      10       0              0                        0
...            ...     ...     ...            ...                      ...
2022-01-24  116967  143875  869608         153916                      216
2022-01-25  117131  144343  872607         154356                      164
2022-01-26  117318  144770  876647         154702                      187
2022-01-27  117488  145159  879006         155040                      170
2022-01-28  117670  145537  882881         155317                      182

[708 rows x 5 columns]

In [72]:
df_filtered['Daily changes in USA'] = df_filtered['US'] - df_filtered.shift(1)['US']
df_filtered['Daily changes in Italy'] = df_filtered['Italy'] - df_filtered.shift(1)['Italy']

In [73]:
df_filtered

,Germany,Italy,US,United Kingdom,Daily changes in Germany,Daily changes in USA,Daily changes in Italy
2020-02-21,0,1,0,0,NaN,NaN,NaN
2020-02-22,0,2,0,0,0,0,1
2020-02-23,0,3,0,0,0,0,1
2020-02-24,0,7,0,0,0,0,4
2020-02-25,0,10,0,0,0,0,3
...,...,...,...,...,...,...,...
2022-01-24,116967,143875,869608,153916,216,1984,352
2022-01-25,117131,144343,872607,154356,164,2999,468
2022-01-26,117318,144770,876647,154702,187,4040,427
2022-01-27,117488,145159,879006,155040,170,2359,389
2022-01-28,117670,145537,882881,155317,182,3875,378

In [74]:
df_filtered['Weekly Change in US'] = df_filtered['US'] - df_filtered.shift(freq='7D')['US']

In [75]:
df_filtered

,Germany,Italy,US,United Kingdom,Daily changes in Germany,Daily changes in USA,Daily changes in Italy,Weekly Change in US
2020-02-21,0,1,0,0,NaN,NaN,NaN,NaN
2020-02-22,0,2,0,0,0,0,1,NaN
2020-02-23,0,3,0,0,0,0,1,NaN
2020-02-24,0,7,0,0,0,0,4,NaN
2020-02-25,0,10,0,0,0,0,3,NaN
...,...,...,...,...,...,...,...,...
2022-01-24,116967,143875,869608,153916,216,1984,352,15460
2022-01-25,117131,144343,872607,154356,164,2999,468,15958
2022-01-26,117318,144770,876647,154702,187,4040,427,16149
2022-01-27,117488,145159,879006,155040,170,2359,389,15897
2022-01-28,117670,145537,882881,155317,182,3875,378,16652

In [76]:
df_filtered['Daily Change in US'] = df_filtered['US'] - df_filtered.shift(freq='1D')['US']

In [77]:
df_filtered

,Germany,Italy,US,United Kingdom,Daily changes in Germany,Daily changes in USA,Daily changes in Italy,Weekly Change in US,Daily Change in US
2020-02-21,0,1,0,0,NaN,NaN,NaN,NaN,NaN
2020-02-22,0,2,0,0,0,0,1,NaN,0
2020-02-23,0,3,0,0,0,0,1,NaN,0
2020-02-24,0,7,0,0,0,0,4,NaN,0
2020-02-25,0,10,0,0,0,0,3,NaN,0
...,...,...,...,...,...,...,...,...,...
2022-01-24,116967,143875,869608,153916,216,1984,352,15460,1984
2022-01-25,117131,144343,872607,154356,164,2999,468,15958,2999
2022-01-26,117318,144770,876647,154702,187,4040,427,16149,4040
2022-01-27,117488,145159,879006,155040,170,2359,389,15897,2359
2022-01-28,117670,145537,882881,155317,182,3875,378,16652,3875

# A real world example of Shifting with Groupped Values in Pandas

In [78]:
df_new = pd.DataFrame(
    {"Group": ['one', 'two' , 'three', 'one', 'two' , 'three', 'one', 'two' , 'three'],
     "Value": [20,30,50, 60,25,15, 30,45,25]
     })

In [79]:
df_new

   Group  Value
0    one     20
1    two     30
2  three     50
3    one     60
4    two     25
5  three     15
6    one     30
7    two     45
8  three     25

In [80]:
df_new = df_new.sort_values(['Group'])

In [81]:
df_new

   Group  Value
0    one     20
3    one     60
6    one     30
2  three     50
5  three     15
8  three     25
1    two     30
4    two     25
7    two     45

In [82]:
df_new.reset_index(inplace=True)

In [83]:
df_new

   index  Group  Value
0      0    one     20
1      3    one     60
2      6    one     30
3      2  three     50
4      5  three     15
5      8  three     25
6      1    two     30
7      4    two     25
8      7    two     45

In [84]:
df_new['shift column'] = df_new.groupby('Group', as_index=False)['Value'].transform(lambda x: x.shift(1))

In [85]:
df_new

   index  Group  Value  shift column
0      0    one     20           NaN
1      3    one     60          20.0
2      6    one     30          60.0
3      2  three     50           NaN
4      5  three     15          50.0
5      8  three     25          15.0
6      1    two     30           NaN
7      4    two     25          30.0
8      7    two     45          25.0

In [86]:
df_new['final rolling avg'] = df_new.groupby('Group', as_index=False)['shift column'].transform(lambda x: x.rolling(3, min_periods=1).mean())

In [87]:
df_new

   index  Group  Value  shift column  final rolling avg
0      0    one     20           NaN                NaN
1      3    one     60          20.0               20.0
2      6    one     30          60.0               40.0
3      2  three     50           NaN                NaN
4      5  three     15          50.0               50.0
5      8  three     25          15.0               32.5
6      1    two     30           NaN                NaN
7      4    two     25          30.0               30.0
8      7    two     45          25.0               27.5

In [88]:
df_new['rolling value avg'] = df_new.groupby('Group', as_index=False)['Value'].transform(lambda x: x.rolling(3, min_periods=1).mean())

In [89]:
df_new

   index  Group  Value  shift column  final rolling avg  rolling value avg
0      0    one     20           NaN                NaN          20.000000
1      3    one     60          20.0               20.0          40.000000
2      6    one     30          60.0               40.0          36.666667
3      2  three     50           NaN                NaN          50.000000
4      5  three     15          50.0               50.0          32.500000
5      8  three     25          15.0               32.5          30.000000
6      1    two     30           NaN                NaN          30.000000
7      4    two     25          30.0               30.0          27.500000
8      7    two     45          25.0               27.5          33.333333